# Transformaci√≥n de los datos

In [3]:
# Carga de paquetes

import pandas as pd
import numpy as np

# Carga de data
rawCsvData = pd.read_csv("../../DataSets/Index2018.csv")
dfComp = rawCsvData.copy()

# View de data

dfComp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [2]:
# Nota que la variable 'DATE' no es interpretada por python.
dfComp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

### From text to date

In [4]:
# Transformando la variable Date con pandas

dfComp.date = pd.to_datetime(dfComp.date, dayfirst = True)

dfComp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

##### NOTA QUE LA VARIABLE DATE TIENE UN FORMATO DIFERENTE. HA SIDO CONVERTIDA A FORMATO FECHA Y PYTHON EST√Å PREPARADO PARA LEERLA.

In [6]:
# Si queremos hacer un resumen de la variable date no tendremos problema.

dfComp.date.describe()

<ipython-input-6-39f1e8d83b97>:3: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  dfComp.date.describe()

count                    6269
unique                   6269
top       1999-11-12 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the index

In [10]:
dfComp.set_index('date', inplace=True)

KeyError: "None of ['date'] are in the columns"

In [12]:
dfComp.head() # ahora la variable date es nuestro √≠ndice

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Setting the desire Frequency

In [14]:
# Definimos la frecuencia seg√∫n el d√≠a ('d'), hora('h'), semana('w'), mensual ('m') y anual ('a')
dfComp = dfComp.asfreq('d')

In [16]:
# Note que se rfellenan con datos faltantes
dfComp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

##### Note que no tenemos datos para fines de semana. Estamos rellenando con data la info faltante

In [19]:
# Podemos cambiar la transformaci√≥n se√±alando serie para nmegocios

dfComp = dfComp.asfreq('b')
dfComp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [20]:
# Valores faltantes

dfComp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [22]:
# Hay 8 valores faltantes
# Rellenamos a los valores  faltantes
# rellanmos con frontfilling. Se asignan con la data del d√≠a posterior
# backfilling, rellenamos con el d√≠a previo.
# podemos asignar con el medio (En ST no tiene sentido).

# para la variable spx rellenamos con el valor posterior
dfComp.spx =dfComp.spx.fillna(method = 'ffill')
dfComp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [23]:
dfComp.ftse =dfComp.ftse.fillna(method = 'bfill')
dfComp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [25]:
dfComp.dax =dfComp.dax.fillna(value = dfComp.dax.mean())
dfComp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [26]:
dfComp.nikkei =dfComp.nikkei.fillna(method = 'bfill')
dfComp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

# Simplifying the Dataset

In [27]:
dfComp['marketValue'] = dfComp.spx

In [28]:
dfComp.describe()

               spx           dax         ftse        nikkei  marketValue
count  6277.000000   6277.000000  6277.000000   6277.000000  6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.597179  1288.642547
std     487.868210   2752.604984  1145.568370   4043.683038   487.868210
min     438.920000   1911.700000  2876.600000   7054.980000   438.920000
25%     992.715221   4070.460000  4487.880000  10701.130000   992.715221
50%    1233.761241   5774.380000  5663.300000  15030.510000  1233.761241
75%    1460.250000   7442.660000  6304.630175  17860.470000  1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000  2872.867839

In [29]:
# eliminar una columna espec√≠fica

del dfComp['spx']

In [30]:
dfComp

                 dax         ftse    nikkei  marketValue
date
1994-01-07   2224.95  3445.980000  18124.01   469.900000
1994-01-10   2225.00  3440.580000  18443.44   475.270000
1994-01-11   2228.10  3413.770000  18485.25   474.130000
1994-01-12   2182.06  3372.020000  18793.88   474.170000
1994-01-13   2142.37  3360.010000  18577.26   472.470000
...              ...          ...       ...          ...
2018-01-23  13559.60  7731.827774  24124.15  2839.130362
2018-01-24  13414.74  7643.428966  23940.78  2837.544008
2018-01-25  13298.36  7615.839954  23669.49  2839.253031
2018-01-26  13340.17  7665.541292  23631.88  2872.867839
2018-01-29  13324.48  7671.533300  23629.34  2853.528411

[6277 rows x 4 columns]

In [31]:
# eliminar m√°s columnas

del dfComp['dax']
del dfComp['ftse']
del dfComp['nikkei']

In [33]:
# s√≥lo nos quedamos con una columna

dfComp.head(14)

            marketValue
date
1994-01-07       469.90
1994-01-10       475.27
1994-01-11       474.13
1994-01-12       474.17
1994-01-13       472.47
1994-01-14       474.91
1994-01-17       473.30
1994-01-18       474.25
1994-01-19       474.30
1994-01-20       474.98
1994-01-21       474.72
1994-01-24       471.97
1994-01-25       470.92
1994-01-26       473.20

# Splitting the data

In [37]:
# Vamos a dividir los datos en datos de prueba y entrenamiento
# En datos de ST la 'cronolog√≠a importan' entonces la divisi√≥n no puede ser aleatoria
# conjunta de entrenamiento 70-80% a prueba 30-20%

size = int(len(dfComp)*0.8)

In [38]:
size

5021

In [42]:
# vamos a generar un subset de entrenamiento

df = dfComp.iloc[:size]
df

            marketValue
date
1994-01-07   469.900000
1994-01-10   475.270000
1994-01-11   474.130000
1994-01-12   474.170000
1994-01-13   472.470000
...                 ...
2013-04-01  1562.173837
2013-04-02  1570.252238
2013-04-03  1553.686978
2013-04-04  1559.979316
2013-04-05  1553.278930

[5021 rows x 1 columns]

In [44]:
# Generamos nuestra data de prueba
dfTest = dfComp[size:]

In [47]:
df.tail()

            marketValue
date
2013-04-01  1562.173837
2013-04-02  1570.252238
2013-04-03  1553.686978
2013-04-04  1559.979316
2013-04-05  1553.278930

In [48]:
dfTest.head()

            marketValue
date
2013-04-08  1563.071269
2013-04-09  1568.607909
2013-04-10  1587.731827
2013-04-11  1593.369863
2013-04-12  1588.854623

#### Comprobamos si existe solapamiento